Revit 2027 API
PointNode.GetPoint Method
 Returns the point object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Point GetPoint()
Public Function GetPoint As Point
public:
Point^ GetPoint()
member GetPoint : unit -> Point
Return Value
Point
 The point instance.
See Also
Reference
PointNode Class
Autodesk.Revit.DB Namespace